org/roam/gpg.org
:PROPERTIES:
:ID:       f72ef287-09ed-40c4-af4c-3bc9634655fe
:END:
#+title: gpg
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t
* GPG
** gpg
- use ~pinentry-mode loopback~ in ~$GNUPGHOME/gpg.conf~ or on the cli for passworded keys on guix
- ~--expert --full-generate-key~ for new ecc key
- ~--armor~ for ascii transferable key
- ~--export~ , ~--export-secret-key~ and ~--import~  for recovery (can also do it for trust store)
- pass
  - ~pass init email@stuff.com~ for loading gpg key
  - ~pass add site/name~ with password
  - ~-m~ for multiline
  - ~pass generate -n site/user size~
- ~gpg --edit-key XXXXX~ then ~trust~ and ~save~
- encrypt ~gpg --encrypt --sign --armor -r a@email.com -r me@email.com~ and ~--sign-key~
- ~gpg --auto-key-locate nodefault,wkd --locate-keys torbrowser@torproject.org~
- ~export GPG_TTY=$(tty)~ for ssh tty
*** TODO extend key expiration date :gpg:
DEADLINE: <2026-05-08 -5d>
